# -*- coding: utf-8 -*-
"""
本科专业完整数据 - 用于导入 major_category 表
"""

# 格式: {门类编码: {门类名, 专业类: {专业类编码: {专业类名, 专业: [(专业编码, 专业名), ...]}}}
UNDERGRADUATE_DATA = {
    "01": {
        "name": "哲学",
        "classes": {
            "0101": {
                "name": "哲学类",
                "majors": [
                    ("010101", "哲学"),
                    ("010102", "逻辑学"),
                    ("010103", "宗教学"),
                    ("010104", "伦理学"),
                ]
            }
        }
    },
    "02": {
        "name": "经济学",
        "classes": {
            "0201": {
                "name": "经济学类",
                "majors": [
                    ("020101", "经济学"),
                    ("020102", "经济统计学"),
                    ("020103", "国民经济管理"),
                    ("020104", "资源与环境经济学"),
                    ("020105", "商务经济学"),
                    ("020106", "能源经济"),
                    ("020107", "劳动经济学"),
                    ("020108", "经济工程"),
                    ("020109", "数字经济"),
                ]
            },
            "0202": {
                "name": "财政学类",
                "majors": [
                    ("020201", "财政学"),
                    ("020202", "税收学"),
                    ("020203", "国际税收"),
                ]
            },
            "0203": {
                "name": "金融学类",
                "majors": [
                    ("020301", "金融学"),
                    ("020302", "金融工程"),
                    ("020303", "保险学"),
                    ("020304", "投资学"),
                    ("020305", "金融数学"),
                    ("020306", "信用管理"),
                    ("020307", "经济与金融"),
                    ("020308", "精算学"),
                    ("020309", "互联网金融"),
                    ("020310", "金融科技"),
                ]
            },
            "0204": {
                "name": "经济与贸易类",
                "majors": [
                    ("020401", "国际经济与贸易"),
                    ("020402", "贸易经济"),
                    ("020403", "国际经济发展合作"),
                ]
            }
        }
    },
    "03": {
        "name": "法学",
        "classes": {
            "0301": {
                "name": "法学类",
                "majors": [
                    ("030101", "法学"),
                    ("030102", "知识产权"),
                    ("030103", "监狱学"),
                    ("030104", "信用风险管理与法律防控"),
                    ("030105", "国际经贸规则"),
                    ("030106", "司法警察学"),
                    ("030107", "社区矫正"),
                    ("030108", "纪检监察"),
                    ("030109", "国际法"),
                    ("030110", "司法鉴定学"),
                    ("030111", "国家安全学"),
                    ("030112", "海外利益安全"),
                ]
            },
            "0302": {
                "name": "政治学类",
                "majors": [
                    ("030201", "政治学与行政学"),
                    ("030202", "国际政治"),
                    ("030203", "外交学"),
                    ("030204", "国际事务与国际关系"),
                    ("030205", "政治学、经济学与哲学"),
                    ("030206", "国际组织与全球治理"),
                ]
            },
            "0303": {
                "name": "社会学类",
                "majors": [
                    ("030301", "社会学"),
                    ("030302", "社会工作"),
                    ("030303", "人类学"),
                    ("030304", "女性学"),
                    ("030305", "家政学"),
                    ("030306", "老年学"),
                    ("030307", "社会政策"),
                ]
            },
            "0304": {
                "name": "民族学类",
                "majors": [("030401", "民族学")]
            },
            "0305": {
                "name": "马克思主义理论类",
                "majors": [
                    ("030501", "科学社会主义"),
                    ("030502", "中国共产党历史"),
                    ("030503", "思想政治教育"),
                    ("030504", "马克思主义理论"),
                ]
            },
            "0306": {
                "name": "公安学类",
                "majors": [
                    ("030601", "治安学"),
                    ("030602", "侦查学"),
                    ("030603", "边防管理"),
                    ("030604", "禁毒学"),
                    ("030605", "警犬技术"),
                    ("030606", "经济犯罪侦查"),
                    ("030607", "边防指挥"),
                    ("030608", "消防指挥"),
                    ("030609", "警卫学"),
                    ("030610", "公安情报学"),
                    ("030611", "犯罪学"),
                    ("030612", "公安管理学"),
                    ("030613", "涉外警务"),
                    ("030614", "国内安全保卫"),
                    ("030615", "警务指挥与战术"),
                    ("030616", "技术侦查学"),
                    ("030617", "海警执法"),
                    ("030618", "公安政治工作"),
                    ("030619", "移民管理"),
                    ("030620", "出入境管理"),
                    ("030621", "反恐警务"),
                    ("030622", "消防政治工作"),
                    ("030623", "铁路警务"),
                ]
            }
        }
    },
    "04": {
        "name": "教育学",
        "classes": {
            "0401": {
                "name": "教育学类",
                "majors": [
                    ("040101", "教育学"),
                    ("040102", "科学教育"),
                    ("040103", "人文教育"),
                    ("040104", "教育技术学"),
                    ("040105", "艺术教育"),
                    ("040106", "学前教育"),
                    ("040107", "小学教育"),
                    ("040108", "特殊教育"),
                    ("040109", "华文教育"),
                    ("040110", "教育康复学"),
                    ("040111", "卫生教育"),
                    ("040112", "认知科学与技术"),
                    ("040113", "融合教育"),
                    ("040114", "劳动教育"),
                ]
            },
            "0402": {
                "name": "体育学类",
                "majors": [
                    ("040201", "体育教育"),
                    ("040202", "运动训练"),
                    ("040203", "社会体育指导与管理"),
                    ("040204", "武术与民族传统体育"),
                    ("040205", "运动人体科学"),
                    ("040206", "运动康复"),
                    ("040207", "休闲体育"),
                    ("040208", "体能训练"),
                    ("040209", "冰雪运动"),
                    ("040210", "电子竞技运动与管理"),
                    ("040211", "智能体育工程"),
                    ("040212", "体育旅游"),
                    ("040213", "运动能力开发"),
                    ("040214", "足球运动"),
                    ("040215", "马术运动与管理"),
                    ("040216", "体育康养"),
                ]
            }
        }
    },
    "05": {
        "name": "文学",
        "classes": {
            "0501": {
                "name": "中国语言文学类",
                "majors": [
                    ("050101", "汉语言文学"),
                    ("050102", "汉语言"),
                    ("050103", "汉语国际教育"),
                    ("050104", "中国少数民族语言文学"),
                    ("050105", "古典文献学"),
                    ("050106", "应用语言学"),
                    ("050107", "秘书学"),
                    ("050108", "中国语言与文化"),
                    ("050109", "手语翻译"),
                    ("050110", "数字人文"),
                    ("050111", "中国古典学"),
                    ("050112", "汉学与中国学"),
                    ("050113", "应用中文"),
                ]
            },
            "0502": {
                "name": "外国语言文学类",
                "majors": [
                    ("050201", "英语"),
                    ("050202", "俄语"),
                    ("050203", "德语"),
                    ("050204", "法语"),
                    ("050205", "西班牙语"),
                    ("050206", "阿拉伯语"),
                    ("050207", "日语"),
                    ("050208", "波斯语"),
                    ("050209", "朝鲜语"),
                    ("050261", "翻译"),
                    ("050262", "商务英语"),
                    ("0502100", "语言学"),
                ]
            },
            "0503": {
                "name": "新闻传播学类",
                "majors": [
                    ("050301", "新闻学"),
                    ("050302", "广播电视学"),
                    ("050303", "广告学"),
                    ("050304", "传播学"),
                    ("050305", "编辑出版学"),
                    ("050306", "网络与新媒体"),
                    ("050307", "数字出版"),
                    ("050308", "时尚传播"),
                    ("050309", "国际新闻与传播"),
                    ("050310", "会展"),
                ]
            }
        }
    },
    "06": {
        "name": "历史学",
        "classes": {
            "0601": {
                "name": "历史学类",
                "majors": [
                    ("060101", "历史学"),
                    ("060102", "世界史"),
                    ("060103", "考古学"),
                    ("060104", "文物与博物馆学"),
                    ("060105", "文物保护技术"),
                    ("060106", "外国语言与外国历史"),
                    ("060107", "文化遗产"),
                    ("060108", "古文字学"),
                    ("060109", "科学史"),
                ]
            }
        }
    },
    "07": {
        "name": "理学",
        "classes": {
            "0701": {
                "name": "数学类",
                "majors": [
                    ("070101", "数学与应用数学"),
                    ("070102", "信息与计算科学"),
                    ("070103", "数理基础科学"),
                    ("070104", "数据计算及应用"),
                ]
            },
            "0702": {
                "name": "物理学类",
                "majors": [
                    ("070201", "物理学"),
                    ("070202", "应用物理学"),
                    ("070203", "核物理"),
                    ("070204", "声学"),
                    ("070205", "系统科学与工程"),
                    ("070206", "量子信息科学"),
                ]
            },
            "0703": {
                "name": "化学类",
                "majors": [
                    ("070301", "化学"),
                    ("070302", "应用化学"),
                    ("070303", "化学生物学"),
                    ("070304", "分子科学与工程"),
                    ("070305", "能源化学"),
                    ("070306", "化学测量学与技术"),
                    ("070307", "资源化学"),
                ]
            },
            "0704": {"name": "天文学类", "majors": [("070401", "天文学")]},
            "0705": {
                "name": "地理科学类",
                "majors": [
                    ("070501", "地理科学"),
                    ("070502", "自然地理与资源环境"),
                    ("070503", "人文地理与城乡规划"),
                    ("070504", "地理信息科学"),
                ]
            },
            "0706": {
                "name": "大气科学类",
                "majors": [
                    ("070601", "大气科学"),
                    ("070602", "应用气象学"),
                    ("070603", "气象技术与工程"),
                    ("070604", "地球系统科学"),
                ]
            },
            "0707": {
                "name": "海洋科学类",
                "majors": [
                    ("070701", "海洋科学"),
                    ("070702", "海洋技术"),
                    ("070703", "海洋资源与环境"),
                    ("070704", "军事海洋学"),
                    ("070705", "海洋地球物理学"),
                ]
            },
            "0708": {
                "name": "地球物理学类",
                "majors": [
                    ("070801", "地球物理学"),
                    ("070802", "空间科学与技术"),
                    ("070803", "防灾减灾科学与工程"),
                    ("070804", "行星科学"),
                    ("070805", "地球信息科学与技术"),
                ]
            },
            "0709": {
                "name": "地质学类",
                "majors": [
                    ("070901", "地质学"),
                    ("070902", "地球化学"),
                    ("070903", "地球信息科学与技术"),
                    ("070904", "古生物学"),
                ]
            },
            "0710": {
                "name": "生物科学类",
                "majors": [
                    ("071001", "生物科学"),
                    ("071002", "生物技术"),
                    ("071003", "生物信息学"),
                    ("071004", "生态学"),
                    ("071005", "整合科学"),
                    ("071006", "神经科学"),
                ]
            },
            "0711": {
                "name": "心理学类",
                "majors": [
                    ("071101", "心理学"),
                    ("071102", "应用心理学"),
                ]
            },
            "0712": {
                "name": "统计学类",
                "majors": [
                    ("071201", "统计学"),
                    ("071202", "应用统计学"),
                    ("071203", "数据科学"),
                    ("071204", "生物统计学"),
                ]
            }
        }
    },
    "08": {
        "name": "工学",
        "classes": {
            "0801": {"name": "力学类", "majors": [("080101", "理论与应用力学"), ("080102", "工程力学")]},
            "0802": {
                "name": "机械类",
                "majors": [
                    ("080201", "机械工程"),
                    ("080202", "机械设计制造及其自动化"),
                    ("080203", "材料成型及控制工程"),
                    ("080204", "机械电子工程"),
                    ("080205", "工业设计"),
                    ("080206", "过程装备与控制工程"),
                    ("080207", "车辆工程"),
                    ("080208", "汽车服务工程"),
                    ("080213", "智能制造工程"),
                    ("080214", "智能车辆工程"),
                    ("080216", "新能源汽车工程"),
                ]
            },
            "0803": {"name": "仪器类", "majors": [("080301", "测控技术与仪器"), ("080302", "精密仪器"), ("080303", "智能感知工程")]},
            "0804": {
                "name": "材料类",
                "majors": [
                    ("080401", "材料科学与工程"),
                    ("080402", "材料物理"),
                    ("080403", "材料化学"),
                    ("080405", "金属材料工程"),
                    ("080406", "无机非金属材料工程"),
                    ("080407", "高分子材料与工程"),
                    ("080414", "新能源材料与器件"),
                ]
            },
            "0805": {
                "name": "能源动力类",
                "majors": [
                    ("080501", "能源与动力工程"),
                    ("080503", "新能源科学与工程"),
                    ("080504", "储能科学与工程"),
                    ("080506", "氢能科学与工程"),
                ]
            },
            "0806": {
                "name": "电气类",
                "majors": [
                    ("080601", "电气工程及其自动化"),
                    ("080602", "智能电网信息工程"),
                    ("080604", "电气工程与智能控制"),
                ]
            },
            "0807": {
                "name": "电子信息类",
                "majors": [
                    ("080701", "电子信息工程"),
                    ("080702", "电子科学与技术"),
                    ("080703", "通信工程"),
                    ("080704", "微电子科学与工程"),
                    ("080705", "光电信息科学与工程"),
                    ("080706", "信息工程"),
                    ("080710", "集成电路设计与集成系统"),
                    ("080717", "人工智能"),
                ]
            },
            "0808": {"name": "自动化类", "majors": [("080801", "自动化"), ("080802", "轨道交通信号与控制"), ("080803", "机器人工程")]},
            "0809": {
                "name": "计算机类",
                "majors": [
                    ("080901", "计算机科学与技术"),
                    ("080902", "软件工程"),
                    ("080903", "网络工程"),
                    ("080904", "信息安全"),
                    ("080905", "物联网工程"),
                    ("080906", "数字媒体技术"),
                    ("080907", "智能科学与技术"),
                    ("080910", "数据科学与大数据技术"),
                    ("080911", "网络空间安全"),
                    ("080917", "区块链工程"),
                ]
            },
            "0810": {
                "name": "土木类",
                "majors": [
                    ("081001", "土木工程"),
                    ("081002", "建筑环境与能源应用工程"),
                    ("081003", "给排水科学与工程"),
                    ("081004", "建筑电气与智能化"),
                    ("081008", "智能建造"),
                ]
            },
            "0811": {"name": "水利类", "majors": [("081101", "水利水电工程"), ("081102", "水文与水资源工程")]},
            "0812": {"name": "测绘类", "majors": [("081201", "测绘工程"), ("081202", "遥感科学与技术")]},
            "0813": {"name": "化工与制药类", "majors": [("081301", "化学工程与工艺"), ("081302", "制药工程")]},
            "0814": {"name": "地质类", "majors": [("081401", "地质工程"), ("081403", "资源勘查工程")]},
            "0815": {"name": "矿业类", "majors": [("081501", "采矿工程"), ("081502", "石油工程"), ("081503", "矿物加工工程")]},
            "0816": {"name": "纺织类", "majors": [("081601", "纺织工程"), ("081602", "服装设计与工程")]},
            "0817": {"name": "轻工类", "majors": [("081701", "轻化工程"), ("081702", "包装工程"), ("081703", "印刷工程")]},
            "0818": {"name": "交通运输类", "majors": [("081801", "交通运输"), ("081802", "交通工程")]},
            "0819": {"name": "海洋工程类", "majors": [("081901", "船舶与海洋工程")]},
            "0820": {"name": "航空航天类", "majors": [("082001", "航空航天工程"), ("082002", "飞行器设计与工程")]},
            "0825": {"name": "环境科学与工程类", "majors": [("082501", "环境科学与工程"), ("082502", "环境工程"), ("082503", "环境科学")]},
            "0826": {"name": "生物医学工程类", "majors": [("082601", "生物医学工程")]},
            "0827": {"name": "食品科学与工程类", "majors": [("082701", "食品科学与工程"), ("082702", "食品质量与安全")]},
            "0828": {"name": "建筑类", "majors": [("082801", "建筑学"), ("082802", "城乡规划"), ("082803", "风景园林")]},
            "0829": {"name": "安全科学与工程类", "majors": [("082901", "安全工程")]},
            "0830": {"name": "生物工程类", "majors": [("083001", "生物工程")]},
        }
    },
    "09": {
        "name": "农学",
        "classes": {
            "0901": {"name": "植物生产类", "majors": [("090101", "农学"), ("090102", "园艺"), ("090103", "植物保护")]},
            "0902": {"name": "自然保护与环境生态类", "majors": [("090201", "农业资源与环境"), ("090203", "水土保持与荒漠化防治")]},
            "0903": {"name": "动物生产类", "majors": [("090301", "动物科学")]},
            "0904": {"name": "动物医学类", "majors": [("090401", "动物医学")]},
            "0905": {"name": "林学类", "majors": [("090501", "林学"), ("090502", "森林保护")]},
            "0906": {"name": "水产类", "majors": [("090601", "水产养殖学")]},
            "0907": {"name": "草学类", "majors": [("090701", "草业科学")]},
        }
    },
    "10": {
        "name": "医学",
        "classes": {
            "1001": {"name": "基础医学类", "majors": [("100101", "基础医学")]},
            "1002": {"name": "临床医学类", "majors": [("100201", "临床医学"), ("100202", "麻醉学"), ("100203", "医学影像学")]},
            "1003": {"name": "口腔医学类", "majors": [("100301", "口腔医学")]},
            "1004": {"name": "公共卫生与预防医学类", "majors": [("100401", "预防医学")]},
            "1005": {"name": "中医学类", "majors": [("100501", "中医学"), ("100502", "针灸推拿学")]},
            "1007": {"name": "药学类", "majors": [("100701", "药学"), ("100702", "药物制剂")]},
            "1008": {"name": "中药学类", "majors": [("100801", "中药学")]},
            "1011": {"name": "护理学类", "majors": [("101101", "护理学")]},
        }
    },
    "12": {
        "name": "管理学",
        "classes": {
            "1201": {"name": "管理科学与工程类", "majors": [("120101", "管理科学"), ("120102", "信息管理与信息系统"), ("120103", "工程管理")]},
            "1202": {
                "name": "工商管理类",
                "majors": [
                    ("120201", "工商管理"),
                    ("120202", "市场营销"),
                    ("120203", "会计学"),
                    ("120204", "财务管理"),
                    ("120206", "人力资源管理"),
                    ("120207", "审计学"),
                    ("120208", "资产评估"),
                ]
            },
            "1204": {"name": "公共管理类", "majors": [("120401", "公共事业管理"), ("120402", "行政管理")]},
            "1205": {"name": "图书情报与档案管理类", "majors": [("120501", "图书馆学"), ("120502", "档案学")]},
            "1206": {"name": "物流管理与工程类", "majors": [("120601", "物流管理"), ("120602", "物流工程")]},
            "1208": {"name": "电子商务类", "majors": [("120801", "电子商务")]},
            "1209": {"name": "旅游管理类", "majors": [("120901", "旅游管理"), ("120902", "酒店管理")]},
        }
    },
    "13": {
        "name": "艺术学",
        "classes": {
            "1301": {"name": "艺术学理论类", "majors": [("130101", "艺术史论")]},
            "1302": {"name": "音乐与舞蹈学类", "majors": [("130201", "音乐表演"), ("130202", "音乐学"), ("130204", "舞蹈表演")]},
            "1303": {"name": "戏剧与影视学类", "majors": [("130301", "表演"), ("130302", "戏剧学"), ("130303", "电影学"), ("130305", "广播电视编导")]},
            "1304": {"name": "美术学类", "majors": [("130401", "美术学"), ("130402", "绘画"), ("130403", "雕塑")]},
            "1305": {"name": "设计学类", "majors": [("130501", "艺术设计学"), ("130502", "视觉传达设计"), ("130503", "环境设计")]},
        }
    },
}
